Tester/src/InformationRegisters/Repositories/Repositories.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Repositories</name>
  <resources>
    <name>Folder</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Mapping</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Application</name>
    <type>
      <types>CatalogRef.Applications</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Computer</name>
    <type>
      <types>CatalogRef.Computers</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/Enums/Scenarios/Scenarios.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scenarios</name>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Library</name>
  </enumValues>
  <enumValues>
    <name>Scenario</name>
  </enumValues>
  <enumValues>
    <name>Method</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Catalogs/Scenarios/Scenarios.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scenarios</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Access</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Application</name>
    <type>
      <types>CatalogRef.Applications</types>
    </type>
  </attributes>
  <attributes>
    <name>Changed</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>LastCreator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Path</name>
    <type>
      <types>DefinedType.ScenarioPath</types>
    </type>
  </attributes>
  <attributes>
    <name>Script</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Severity</name>
    <type>
      <types>EnumRef.Severity</types>
    </type>
  </attributes>
  <attributes>
    <name>Sorting</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Spreadsheet</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Tag</name>
    <type>
      <types>CatalogRef.TagKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>Template</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Tree</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Scenarios</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Areas</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Top</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Left</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Bottom</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Right</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Users</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/CommonModules/WatcherSrv/Module.bsl
Function MappedApplications () export
	
	table = getFolders ();
	result = new Structure ();
	result.Insert ( "Applications", table.UnloadColumn ( "Application" ) );
	result.Insert ( "Folders", table.UnloadColumn ( "Folder" ) );
	return result;
	
EndFunction

Function getFolders ()
	
	s = "
	|select allowed Repositories.Application as Application, Repositories.Folder as Folder
	|from InformationRegister.Repositories as Repositories
	|where Repositories.User = &User
	|and Repositories.Computer = &Computer
	|and Repositories.Mapping
	|";
	q = new Query ( s );
	q.SetParameter ( "User", SessionParameters.User );
	q.SetParameter ( "Computer", SessionData.Computer () );
	return q.Execute ().Unload ();
	
EndFunction

Function Update ( val Scenario, val Script ) export
	
	var errors;
	
	LockingForm.Lock ( wrapScenario ( Scenario ), undefined, errors );
	if ( errors = undefined ) then
		return updateScript ( Scenario, Script );
	endif;
	Output.LockError ( errors [ 0 ] );
	return false;
	
EndFunction

Function wrapScenario ( Scenario )
	
	table = new ValueTable ();
	table.Columns.Add ( "Ref", new TypeDescription ( "CatalogRef.Scenarios" ) );
	row = table.Add ();
	row.Ref = Scenario;
	return table;
	
EndFunction

Function updateScript ( Scenario, Script )
	
	obj = Scenario.GetObject ();
	if ( obj.Script = Script ) then
		return false;
	endif;
	obj.Script = Script;
	excludeMe ( obj );
	obj.Write ();
	return true;
		
EndFunction

Procedure excludeMe ( Object )
	
	Object.DataExchange.Sender = findMe ( Object );

EndProcedure

Function findMe ( Object )
	
	s = "
	|select Nodes.Ref as Ref
	|from ExchangePlan.Changes as Nodes
	|where not Nodes.DeletionMark
	|and Nodes.User = &User
	|and Nodes.Application = &Application
	|";
	q = new Query ( s );
	q.SetParameter ( "User", SessionParameters.User );
	q.SetParameter ( "Application", Object.Application );
	table = q.Execute ().Unload ();
	return ? ( table.Count () = 0, undefined, table [ 0 ].Ref );
	
EndFunction

Function GetMethods ( val Starting ) export
	
	table = getScenarios ( Starting );
	result = new Array ();
	for each row in table do
		result.Add ( new Structure ( "Path, Application", row.Path, row.Application ) );
	enddo;
	return result;
	
EndFunction

Function getScenarios ( Starting )
	
	q = new Query ();
	s = "
	|select allowed Scenarios.Path as Path,
	|	isnull ( Scenarios.Application.Description, &Common ) as Application
	|from Catalog.Scenarios as Scenarios
	|where not Scenarios.DeletionMark
	|and Scenarios.Type = value ( Enum.Scenarios.Method )
	|";
	if ( Starting <> undefined ) then
		s = s + "
		|and Scenarios.Parent in hierarchy ( &Folder )";
		q.SetParameter ( "Folder", DF.Pick ( Starting, "Parent" ) );
	endif;
	s = s + "
	|order by Path, Application
	|";
	q.Text = s;
	q.SetParameter ( "Common", Output.CommonApplicationName () );
	return q.Execute ().Unload ();
	
EndFunction
